=======================================================================
Model name: fashion-1-16-256-0.001-7
 The combination: 1,
 learning rate: 0.001,
 epochs: 16,
 batch size: 256,
 seed: 7
32, 64; 16, 32 in conv1 and conv2; 64 double Dense with dr 0.5
Training time: 1298.98 seconds
Training Accuracy: 89.08%
Test accuracy: 91.21%

The Architecture of the Model:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 28, 28, 32)        160       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 28, 28, 64)        8256      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 16)        4112      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 14, 14, 32)        2080      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 7, 7, 32)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1568)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                100416    
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                4160      
_________________________________________________________________
dropout_2 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                650       
=================================================================
Total params: 119,834
Trainable params: 119,834
Non-trainable params: 0
_________________________________________________________________
=======================================================================

=======================================================================
Model name: fashion-1-24-128-0.001-7
 The combination: 1,
 learning rate: 0.001,
 epochs: 24,
 batch size: 128,
 seed: 7
64; 64, 64 in conv1 and conv2; 256 double Dense with dr 0.4
Training time: 1985.55 seconds
Training Accuracy: 97.69%
Test accuracy: 92.34%

The Architecture of the Model:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 28, 28, 64)        320       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 64)        16448     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 64)        16448     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 7, 7, 64)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 3136)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               803072    
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 256)               65792     
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                2570      
=================================================================
Total params: 904,650
Trainable params: 904,650
Non-trainable params: 0
_________________________________________________________________
=======================================================================

=======================================================================
Model name: fashion-1-24-128-0.001-7-m3
 The combination: 1,
 learning rate: 0.001,
 epochs: 24,
 batch size: 128,
 seed: 7
64, 64; 32, 32 in conv1 and conv2; 128 double Dense with dr 0.4
Training time: 3338.06 seconds
Training Accuracy: 95.86%
Test accuracy: 92.62%

The Architecture of the Model:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 28, 28, 64)        320       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 28, 28, 64)        16448     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 32)        8224      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 14, 14, 32)        4128      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 7, 7, 32)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1568)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               200832    
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                1290      
=================================================================
Total params: 247,754
Trainable params: 247,754
Non-trainable params: 0
_________________________________________________________________
=======================================================================

=======================================================================
Model name: fashion-1-16-128-0.001-7-m4
 The combination: 1,
 learning rate: 0.001,
 epochs: 16,
 batch size: 128,
 seed: 7
32, 32; 32, 32 in conv1 and conv2; 100 double Dense with dr 0.4
Training time: 1026.29 seconds
Training Accuracy: 93.81%
Test accuracy: 92.64%

The Architecture of the Model:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 28, 28, 32)        160       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 28, 28, 32)        4128      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 32)        4128      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 14, 14, 32)        4128      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 7, 7, 32)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1568)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               156900    
_________________________________________________________________
dropout_1 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 100)               10100     
_________________________________________________________________
dropout_2 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                1010      
=================================================================
Total params: 180,554
Trainable params: 180,554
Non-trainable params: 0
_________________________________________________________________
=======================================================================

=======================================================================
Model name: fashion-1-15-256-0.001-7-m5
 The combination: 1,
 learning rate: 0.001,
 epochs: 15,
 batch size: 256,
 seed: 7
32, 64; 32 in conv1 and conv2; 100 double Dense with dr 0.4
Training time: 1278.96 seconds
Training Accuracy: 93.17%
Test accuracy: 92.10%

The Architecture of the Model:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 28, 28, 32)        160       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 28, 28, 64)        8256      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 32)        8224      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 7, 7, 32)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1568)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               156900    
_________________________________________________________________
dropout_1 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 100)               10100     
_________________________________________________________________
dropout_2 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                1010      
=================================================================
Total params: 184,650
Trainable params: 184,650
Non-trainable params: 0
_________________________________________________________________
=======================================================================

=======================================================================
Model name: fashion-1-18-128-0.001-7-m6
 The combination: 1,
 learning rate: 0.001,
 epochs: 18,
 batch size: 128,
 seed: 7
32; 32 in conv1 and conv2; 100 double Dense with dr 0.4
Training time: 484.17 seconds
Training Accuracy: 96.31%
Test accuracy: 91.67%

The Architecture of the Model:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 28, 28, 32)        160       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 32)        4128      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 7, 7, 32)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1568)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               156900    
_________________________________________________________________
dense_2 (Dense)              (None, 100)               10100     
_________________________________________________________________
dense_3 (Dense)              (None, 10)                1010      
=================================================================
Total params: 172,298
Trainable params: 172,298
Non-trainable params: 0
_________________________________________________________________
=======================================================================

=======================================================================
Model name: fashion-2-15-64-0.001-7-m7
 The combination: 2,
 learning rate: 0.001,
 epochs: 15,
 batch size: 64,
 seed: 7
32 32 in conv with constant bias; 128 single Dense
Training time: 826.59 seconds
Training Accuracy: 98.81%
Test accuracy: 90.95%

The Architecture of the Model:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_1 (Batch (None, 28, 28, 1)         4         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 32)        160       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 28, 28, 32)        4128      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 14, 14, 32)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 6272)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               802944    
_________________________________________________________________
dense_2 (Dense)              (None, 10)                1290      
=================================================================
Total params: 808,526
Trainable params: 808,524
Non-trainable params: 2
_________________________________________________________________
=======================================================================

=======================================================================
Model name: fashion-2-10-256-0.001-7-m8
 The combination: 2,
 learning rate: 0.001,
 epochs: 10,
 batch size: 256,
 seed: 7
single 64 in conv with Average Pooling; 64 double Dense
Training time: 360.66 seconds
Training Accuracy: 92.17%
Test accuracy: 90.05%

The Architecture of the Model:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 28, 28, 64)        320       
_________________________________________________________________
average_pooling2d_1 (Average (None, 14, 14, 64)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 12544)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                802880    
_________________________________________________________________
dense_2 (Dense)              (None, 64)                4160      
_________________________________________________________________
dense_3 (Dense)              (None, 10)                650       
=================================================================
Total params: 808,010
Trainable params: 808,010
Non-trainable params: 0
_________________________________________________________________
=======================================================================

=======================================================================
Model name: fashion-3-16-64-0.001-7-m9
 The combination: 3,
 learning rate: 0.001,
 epochs: 16,
 batch size: 64,
 seed: 7
256 double Dense with 0.5 drop out rate
Training time: 109.99 seconds
Training Accuracy: 87.37%
Test accuracy: 87.45%

The Architecture of the Model:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_1 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               200960    
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 256)               65792     
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                2570      
=================================================================
Total params: 269,322
Trainable params: 269,322
Non-trainable params: 0
_________________________________________________________________
=======================================================================

=======================================================================
Model name: fashion-3-30-32-0.001-7-m10
 The combination: 3,
 learning rate: 0.001,
 epochs: 30,
 batch size: 32,
 seed: 7
256 double Dense with 0.6 drop out rate
Training time: 289.24 seconds
Training Accuracy: 85.82%
Test accuracy: 86.77%

The Architecture of the Model:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_1 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               200960    
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 256)               65792     
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                2570      
=================================================================
Total params: 269,322
Trainable params: 269,322
Non-trainable params: 0
_________________________________________________________________
=======================================================================

=======================================================================
Model name: fashion-3-30-32-0.001-7-m11
 The combination: 3,
 learning rate: 0.001,
 epochs: 30,
 batch size: 32,
 seed: 7
256 double Dense with 0.5 drop out rate
Training time: 296.45 seconds
Training Accuracy: 87.70%
Test accuracy: 88.30%

The Architecture of the Model:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_1 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               200960    
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 256)               65792     
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                2570      
=================================================================
Total params: 269,322
Trainable params: 269,322
Non-trainable params: 0
_________________________________________________________________
=======================================================================

